docs/pages/states/states.md
```mermaid
---
title: Parallel states diagram
---
stateDiagram-v2
state Laptop {
  [*] --> Charging
  Charging --> OnBattery 
  OnBattery --> Charging 
  --
  [*] --> LidOpen
  LidOpen --> LidClosed 
  LidClosed --> LidOpen
  --
  [*] --> Sleeping
  Sleeping --> Working 
  Working --> Sleeping 
}
```
